; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v12)
             (pred_12 ?v11 ?v1)
             (pred_7 ?v2 ?v1)
             (pred_9 ?v6 ?v2 )
	     (pred_10 ?v2)
             (pred_11 ?v4)
             (pred_8 ?v11)
             (pred_6 ?v1)
             (pred_5 ?v2)
             (pred_1 ?v11)
             (pred_3 ?v2)
             (pred_2 ))



(:action op_5
:parameters (?v7 ?v8 ?v9 ?v10)
:precondition (and (pred_11 ?v7) (pred_11 ?v8) (pred_8 ?v9) (pred_6 ?v10)
          (pred_4 ?v7 ?v8) (pred_12 ?v9 ?v10)
                   (pred_7 ?v8 ?v10) (pred_10 ?v7) 
                   (pred_5 ?v8) (pred_1 ?v9))
:effect (and  (pred_3 ?v8) (not (pred_5 ?v8))))


(:action op_3
:parameters (?v7 ?v3)
:precondition (and (pred_11 ?v7) (pred_11 ?v3)
               (pred_10 ?v7) (pred_4 ?v7 ?v3) (pred_3 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v7))))

(:action op_2
:parameters (?v7 ?v9)
:precondition (and (pred_11 ?v7) (pred_8 ?v9) 
                  (pred_10 ?v7) (pred_9 ?v9 ?v7) (pred_2 ))
:effect (and (pred_1 ?v9)
   (not (pred_9 ?v9 ?v7)) (not (pred_2 ))))


(:action op_4
:parameters (?v7 ?v13 ?v5)
:precondition (and (pred_11 ?v7) (pred_8 ?v13) (pred_8 ?v5)
                  (pred_10 ?v7) (pred_1 ?v5) (pred_9 ?v13 ?v7))
:effect (and (pred_1 ?v13) (pred_9 ?v5 ?v7)
        (not (pred_1 ?v5)) (not (pred_9 ?v13 ?v7))))

(:action op_1
:parameters (?v7 ?v9)
:precondition (and (pred_11 ?v7) (pred_8 ?v9) 
                  (pred_10 ?v7) (pred_1 ?v9))
:effect (and (pred_2 ) (pred_9 ?v9 ?v7) (not (pred_1 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_31 obj_15 obj_06 obj_29 obj_10 obj_24 obj_03 obj_01 obj_27 obj_13 obj_26 obj_14 obj_11 obj_28 obj_30 obj_12 obj_02 obj_23 obj_17 obj_08 obj_22 obj_20 obj_25 obj_19 obj_07
    obj_18 obj_21 obj_04
    obj_09 obj_16 obj_05
    )

    (:init
       (pred_2)

       (pred_11 obj_31)
       (pred_11 obj_15)
       (pred_11 obj_06)
       (pred_11 obj_29)
       (pred_11 obj_10)
       (pred_11 obj_24)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_27)
       (pred_11 obj_13)
       (pred_11 obj_26)
       (pred_11 obj_14)
       (pred_11 obj_11)
       (pred_11 obj_28)
       (pred_11 obj_30)
       (pred_11 obj_12)
       (pred_11 obj_02)
       (pred_11 obj_23)
       (pred_11 obj_17)
       (pred_11 obj_08)
       (pred_11 obj_22)
       (pred_11 obj_20)
       (pred_11 obj_25)
       (pred_11 obj_19)
       (pred_11 obj_07)
       (pred_6 obj_18)
       (pred_6 obj_21)
       (pred_6 obj_04)
       (pred_8 obj_09)
       (pred_8 obj_16)
       (pred_8 obj_05)

       (pred_4 obj_31 obj_24)
       (pred_4 obj_31 obj_15)
       (pred_4 obj_15 obj_03)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_15 obj_31)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_06 obj_29)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_29 obj_27)
       (pred_4 obj_29 obj_10)
       (pred_4 obj_29 obj_06)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_10 obj_29)
       (pred_4 obj_24 obj_26)
       (pred_4 obj_24 obj_03)
       (pred_4 obj_24 obj_31)
       (pred_4 obj_03 obj_14)
       (pred_4 obj_03 obj_01)
       (pred_4 obj_03 obj_15)
       (pred_4 obj_03 obj_24)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_01 obj_27)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_01 obj_03)
       (pred_4 obj_27 obj_28)
       (pred_4 obj_27 obj_13)
       (pred_4 obj_27 obj_29)
       (pred_4 obj_27 obj_01)
       (pred_4 obj_13 obj_30)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_13 obj_27)
       (pred_4 obj_26 obj_12)
       (pred_4 obj_26 obj_14)
       (pred_4 obj_26 obj_24)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_14 obj_11)
       (pred_4 obj_14 obj_03)
       (pred_4 obj_14 obj_26)
       (pred_4 obj_11 obj_23)
       (pred_4 obj_11 obj_28)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_14)
       (pred_4 obj_28 obj_17)
       (pred_4 obj_28 obj_30)
       (pred_4 obj_28 obj_27)
       (pred_4 obj_28 obj_11)
       (pred_4 obj_30 obj_08)
       (pred_4 obj_30 obj_13)
       (pred_4 obj_30 obj_28)
       (pred_4 obj_12 obj_22)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_26)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_02 obj_23)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_23 obj_25)
       (pred_4 obj_23 obj_17)
       (pred_4 obj_23 obj_11)
       (pred_4 obj_23 obj_02)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_17 obj_28)
       (pred_4 obj_17 obj_23)
       (pred_4 obj_08 obj_07)
       (pred_4 obj_08 obj_30)
       (pred_4 obj_08 obj_17)
       (pred_4 obj_22 obj_20)
       (pred_4 obj_22 obj_12)
       (pred_4 obj_20 obj_25)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_20 obj_22)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_25 obj_23)
       (pred_4 obj_25 obj_20)
       (pred_4 obj_19 obj_07)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_07 obj_08)
       (pred_4 obj_07 obj_19)
       (pred_5 obj_22)
       (pred_5 obj_30)
       (pred_5 obj_20)
       (pred_7  obj_22 obj_18)
       (pred_7  obj_30 obj_21)
       (pred_7  obj_20 obj_04)
       (pred_3 obj_31)
       (pred_3 obj_15)
       (pred_3 obj_06)
       (pred_3 obj_29)
       (pred_3 obj_10)
       (pred_3 obj_24)
       (pred_3 obj_03)
       (pred_3 obj_01)
       (pred_3 obj_27)
       (pred_3 obj_13)
       (pred_3 obj_26)
       (pred_3 obj_14)
       (pred_3 obj_11)
       (pred_3 obj_28)
       (pred_3 obj_12)
       (pred_3 obj_02)
       (pred_3 obj_23)
       (pred_3 obj_17)
       (pred_3 obj_08)
       (pred_3 obj_25)
       (pred_3 obj_19)
       (pred_3 obj_07)

       (pred_12  obj_09 obj_18)
       (pred_12  obj_16 obj_21)
       (pred_12  obj_05 obj_04)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_16 obj_02)
       (pred_9 obj_05 obj_28)
       (pred_10 obj_28)
    )

    (:goal (and
       (pred_9 obj_16 obj_23)
       (pred_9 obj_05 obj_15)
    ))
(:constraints
  (always (not (pred_10 obj_11)))
)
)

; plan
1. (op_3 obj_28 obj_17)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_17)
   goals met: 0 of 2
2. (op_3 obj_17 obj_23)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_23)
   goals met: 0 of 2
3. (op_3 obj_23 obj_02)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_02)
   goals met: 0 of 2
4. (op_2 obj_02 obj_16)
   deleted: (pred_9 obj_16 obj_02) (pred_2)
   added: (pred_1 obj_16)
   goals met: 0 of 2
5. (op_3 obj_02 obj_23)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_23)
   goals met: 0 of 2
6. (op_1 obj_23 obj_16)
   deleted: (pred_1 obj_16)
   added: (pred_2) (pred_9 obj_16 obj_23)
   goals met: 1 of 2
7. (op_3 obj_23 obj_17)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_17)
   goals met: 1 of 2
8. (op_3 obj_17 obj_28)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_28)
   goals met: 1 of 2
9. (op_2 obj_28 obj_05)
   deleted: (pred_9 obj_05 obj_28) (pred_2)
   added: (pred_1 obj_05)
   goals met: 1 of 2
10. (op_3 obj_28 obj_27)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_27)
   goals met: 1 of 2
11. (op_3 obj_27 obj_29)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_29)
   goals met: 1 of 2
12. (op_3 obj_29 obj_06)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_06)
   goals met: 1 of 2
13. (op_3 obj_06 obj_15)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_15)
   goals met: 1 of 2
14. (op_1 obj_15 obj_05)
   deleted: (pred_1 obj_05)
   added: (pred_2) (pred_9 obj_05 obj_15)
   goals met: 2 of 2
